examples/aldFoam/0/U
// This file is part of aldFoam
// Copyright 2019 Argonne UChicago LLC

FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
8000
(
(0.736803 0.117635 0)
(0.620274 0.101013 0)
(0.454621 0.051439 0)
(0.337198 0.0266464 0)
(0.267491 0.0149109 0)
(0.22485 0.00846684 0)
(0.197783 0.00485255 0)
(0.180378 0.00283707 0)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    substrate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
