examples/aldFoam/0/p
// This file is part of aldFoam
// Copyright 2019 Argonne UChicago LLC

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "19";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
8000
(
140.94
129.133
123.26
120.68
119.247
118.349
117.747
117.304
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    substrate
    {
        type            zeroGradient;
    }
    Wall
    {
        type            zeroGradient;
    }
}
